[
    {
        "name" : "JPMorganChase",
        "website": "https://www.jpmorganchase.com/",
        "gradient" : "linear-gradient(45deg, rgba(97,54,29,1) 20%, rgba(149,96,64,1) 100%)",
        "title": "Software Engineer I, Full-Stack",
        "start" : "Jul 2023",
        "end" : "Jul 2024",
        "experience" : ["Supported 50+ applications during First Republic and JPMorganChase merger leading to no data loss or downtime of applications used by First Republic developers and clients. Assisted JPMorganChase's Evidence team add additional procedures to their deployment dashboard and their CI pipeline evidence API."],
        "tech" :  ["ReactJS", "Spring Boot", "Jest", "PostgreSQL", "Kafka", "Datadog", "Splunk", "Terraform", "AWS"]
    },
    {
        "name": "First Republic",
        "website": "https://www.firstrepublic.com/",
        "gradient": "linear-gradient(239.26deg, #0F5E12 29.68%, #2E7C31 68.65%)",
        "title": "Software Engineer, Developer Experience",
        "start" : "Aug 2022",
        "end" : "Jul 2023",
        "experience" : ["Developed a customized Python CLI build and deployment tools, streamlining processes for 1000+ engineers. Increased efforts of visibility of security vulnerabilities using Aquasec, WebInspect, and Veracode for the DevOps team’s internal sample applications and devops toolkit by running daily, automated Jenkins cronjobs. Began working on efforts to overhaul from Python to Golang and modularization efforts of the firm’s internal developer tool kit."],
        "tech" :  ["Flask", "Spring Boot", "Node.js", ".NET", "Docker", "Kubernetes", "Jenkins", "JFrog Artifactory", "NewRelic", "Aquasec", "Veracode", "WebInspect", "AWS"]
    },
    {
        "name": "UCIrvine Student Affairs IT",
        "website": "https://studentaffairs.uci.edu/",
        "gradient": "linear-gradient(59.26deg, #00263E -25.04%, #0064A4 72.93%)",
        "title": "Full Stack Web Developer",
        "start" : "Mar 2021",
        "end" : "Jun 2022",
        "experience" : ["Utilized VueJS, PHP-Laravel, and MySQL to develop a responsive web portal for 10,000+ UC Irvine students registering for graduation ceremonies. Designed and deployed the Volunteer HQ view to enhance staff tracking of volunteer assignments, check-in/out statuses, and profiles, resulting in streamlined volunteer management processes. Launched a QR scanning check-in page, using vue-qrcode-reader, reducing student check-in time by 1 hour and improving the efficiency of volunteer management during graduation ceremonies."],
        "tech" :  ["VueJS", "Laravel", "MySQL", "SASS", "Cypress", "Lando"]
    }
]